In this lab, the objective is to identify the customers who were active in both May and June, and how did their activity differ between months. To achieve this, follow these steps:

In [1]:
import pandas as pd
import getpass
import sqlalchemy as sa

Establish a connection between Python and the Sakila database.

In [2]:
driver = 'mysql+pymysql'
user = 'root'
password = getpass.getpass(prompt='Your password:'"")
ip = '127.0.0.1'

Your password:········

In [3]:
connection_string = f'{driver}://{user}:{password}@{ip}'

In [4]:
connection_string

'mysql+pymysql://root:gen101894@127.0.0.1'

In [5]:
db_connection = sa.create_engine(connection_string)

In [6]:
insp = sa.inspect(db_connection)
db_list = insp.get_schema_names()
print(db_list)

['bank', 'information_schema', 'lab_db_python_sql', 'mysql', 'performance_schema', 'sakila', 'sys']

In [18]:
query="SELECT * FROM sakila.rental"
actor_info = pd.read_sql_query(query, db_connection)
actor_info

,rental_id,rental_date,inventory_id,customer_id,return_date,staff_id,last_update
0,1,2005-05-24 22:53:30,367,130,2005-05-26 22:04:30,1,2006-02-15 21:30:53
1,2,2005-05-24 22:54:33,1525,459,2005-05-28 19:40:33,1,2006-02-15 21:30:53
2,3,2005-05-24 23:03:39,1711,408,2005-06-01 22:12:39,1,2006-02-15 21:30:53
3,4,2005-05-24 23:04:41,2452,333,2005-06-03 01:43:41,2,2006-02-15 21:30:53
4,5,2005-05-24 23:05:21,2079,222,2005-06-02 04:33:21,1,2006-02-15 21:30:53
...,...,...,...,...,...,...,...
16039,16045,2005-08-23 22:25:26,772,14,2005-08-25 23:54:26,1,2006-02-15 21:30:53
16040,16046,2005-08-23 22:26:47,4364,74,2005-08-27 18:02:47,2,2006-02-15 21:30:53
16041,16047,2005-08-23 22:42:48,2088,114,2005-08-25 02:48:48,2,2006-02-15 21:30:53
16042,16048,2005-08-23 22:43:07,2019,103,2005-08-31 21:33:07,1,2006-02-15 21:30:53
16043,16049,2005-08-23 22:50:12,2666,393,2005-08-30 01:01:12,2,2006-02-15 21:30:53

Write a Python function called rentals_month that retrieves rental data for a given month and year (passed as parameters) from the Sakila database as a Pandas DataFrame.
The function should take in three parameters:

engine: an object representing the database connection engine to be used to establish a connection to the Sakila database.
month: an integer representing the month for which rental data is to be retrieved.
year: an integer representing the year for which rental data is to be retrieved.
The function should execute a SQL query to retrieve the rental data for the specified month and year from the rental table in the Sakila database, and return it as a pandas DataFrame.

In [19]:
def rentals_month(engine, month, year):
    query = "SELECT * FROM rental WHERE MONTH(rental_date) = " + str(month) + " AND YEAR(rental_date) = " + str(year)
    df = pd.read_sql(query, engine)
    return df

In [20]:
rentals_month

Develop a Python function called rental_count_month that takes the DataFrame provided by rentals_month as input along with the month and year and returns a new DataFrame containing the number of rentals made by each customer_id during the selected month and year.

The function should also include the month and year as parameters and use them to name the new column according to the month and year, for example, if the input month is 05 and the year is 2005, the column name should be "rentals_05_2005".

Hint: Consider making use of pandas groupby()

In [ ]:

import pandas as pd

def rental_count_month(df, month, year):
    filtered_df = df[(df['rental_date'].dt.month == month) & (df['rental_date'].dt.year == year)]
    
    rental_count = {}
    for _, row in filtered_df.iterrows():
        customer_id = row['customer_id']
        if customer_id in rental_count:
            rental_count[customer_id] += 1
        else:
            rental_count[customer_id] = 1
    
    rental_count = pd.DataFrame.from_dict(rental_count, orient='index', columns=[f'rentals_{month:02d}_{year:04d}'])
    rental_count.reset_index(inplace=True)
    rental_count.rename(columns={'index': 'customer_id'}, inplace=True)
    
    return rental_count

In [ ]:
import pandas as pd

def rental_count_month(df, month, year):
    column_name = f'rentals_{month:02d}_{year:04d}'
    rental_count = df[df['rental_date'].dt.month.eq(month) & df['rental_date'].dt.year.eq(year)]
    rental_count = rental_count.groupby('customer_id').size().reset_index(name=column_name)
    return rental_count

Create a Python function called compare_rentals that takes two DataFrames as input containing the number of rentals made by each customer in different months and years. The function should return a combined DataFrame with a new 'difference' column, which is the difference between the number of rentals in the two months.